{
    "alpha_pattern": {},
    "auto_mapping": null,
    "base_model_name_or_path": "microsoft/deberta-v3-large",
    "bias": "none",
    "eva_config": null,
    "exclude_modules": null,
    "fan_in_fan_out": false,
    "inference_mode": true,
    "init_lora_weights": "pissa",
    "layer_replication": null,
    "layers_pattern": null,
    "layers_to_transform": [
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15,
        16,
        17,
        18,
        19,
        20,
        21,
        22,
        23
    ],
    "loftq_config": {},
    "lora_alpha": 16,
    "lora_bias": false,
    "lora_dropout": 0.1,
    "megatron_config": null,
    "megatron_core": "megatron.core",
    "modules_to_save": [
        "classifier",
        "score"
    ],
    "peft_type": "LORA",
    "r": 8,
    "rank_pattern": {},
    "revision": null,
    "target_modules": [
        "value_proj",
        "dense",
        "key_proj",
        "query_proj"
    ],
    "task_type": "SEQ_CLS",
    "use_dora": false,
    "use_rslora": false
}